gestion-bd-asir1/apuntes/6/BD-6-Ejemplos-PLSQL.org
* Programación

** Tabla de multiplicar Del 7
** Tablas de multiplicar del 1 al 9
** Tablas de multiplicar bien alineadas
** Pasar de decimal a binario
** Pasar de decimal a una base entre 2 y 16
** Pasar de una base de 2 a 16 a decimal 
** Números primos menores de 1000
** Decidir si un número es capicúa
** Números primos capicúas menores de 100000

** Decidir si 1000003 es primo
#+begin_src sql
declare
  posibleprimo numeric(10,0) := 1000003;
  limitededivisores numeric(10,0);
  esprimo boolean := true;
begin
  limitededivisores := sqrt(posibleprimo)+1;
  for posibledivisor in 2..limitededivisores loop
     esprimo := mod(posibleprimo,posibledivisor) <> 0;
     exit when not esprimo;
     
  end loop;
  if( esprimo ) then
    dbms_output.put_line( posibleprimo || ' es primo'  );
  else
    dbms_output.put_line( posibleprimo || ' NO es primo'  );
  end if;
end;
/
#+end_src


** Convertir boolean a char
#+begin_src sql
create or replace function bool2char(b in boolean) return varchar 
is
begin
  return (case b when true then 'si' else 'no' end );

end;
/
#+end_src


** Primos
#+begin_src sql
create or replace function es_primo(posibleprimo IN number) return char
is
  esprimo boolean := true;
begin
  for posibledivisor in 2..(sqrt(posibleprimo)) loop
     esprimo := mod(posibleprimo,posibledivisor) <> 0;
     exit when not esprimo;
  end loop;
  return case esprimo
    when true then 's'
    else 'n' 
  end;  
end;
/
#+end_src

#+begin_src sql
begin
  for i in 2 .. 1000 loop
    if( es_primo(i) = 's' ) then
      dbms_output.put_line( 'Es primo:' || i );
    end if;
  end loop;
end;
/
#+end_src


** Paso por valor
#+begin_src sql
create or replace procedure sumaUno(n in out numeric)
is
begin
  n := n +1;
end;
/

declare
  numero numeric(10,0);
begin
  numero := 3;
  sumauno(3);
  dbms_output.put_line(numero);
end;
/

#+end_src






* Estudiantes

** Estadística por nombre
#+begin_src sql
create or replace function cuantos_se_llaman(nombre_o_apellidos in varchar) return numeric
as
  cuantosnombres numeric;
  cuantosapellidos numeric;

begin
  select count(*) 
     into cuantosnombres 
     from student 
     where first_name = nombre_o_apellidos;
  
  select count(*) 
     into cuantosapellidos 
     from student 
     where last_name = nombre_o_apellidos;
  
  return cuantosnombres + cuantosapellidos;

end;
/

begin
  dbms_output.put_line( cuantos_se_llaman('González') );
end;
/
#+end_src


