gestion-bd-asir1/apuntes/6/BD-6-Ejemplos-PLSQL.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-04-03 mar 17:50 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="alvaro" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orga9805cc">1. Programación</a>
<ul>
<li><a href="#org7637491">1.1. Tabla de multiplicar Del 7</a></li>
<li><a href="#org8cfe6bd">1.2. Tablas de multiplicar del 1 al 9</a></li>
<li><a href="#org0212e3c">1.3. Tablas de multiplicar bien alineadas</a></li>
<li><a href="#org4e46892">1.4. Pasar de decimal a binario</a></li>
<li><a href="#orgb0a015d">1.5. Pasar de decimal a una base entre 2 y 16</a></li>
<li><a href="#org5fe4821">1.6. Pasar de una base de 2 a 16 a decimal</a></li>
<li><a href="#org40402ac">1.7. Números primos menores de 1000</a></li>
<li><a href="#org6b52540">1.8. Decidir si un número es capicúa</a></li>
<li><a href="#org514ff0a">1.9. Números primos capicúas menores de 100000</a></li>
<li><a href="#org1c67092">1.10. Decidir si 1000003 es primo</a></li>
<li><a href="#org087bea4">1.11. Convertir boolean a char</a></li>
<li><a href="#org2b00117">1.12. Primos</a></li>
<li><a href="#orgc8423a5">1.13. Paso por valor</a></li>
</ul>
</li>
<li><a href="#org28a1595">2. Estudiantes</a>
<ul>
<li><a href="#org910731b">2.1. Estadística por nombre</a></li>
<li><a href="#org30ebee3">2.2. Matricular un hermano</a></li>
<li><a href="#orgb256afb">2.3. Calcular nota máxima y mínima</a></li>
<li><a href="#orgcd3e5f3">2.4. Calcular la media de notas por encima de cierto valor</a></li>
<li><a href="#org6fed05d">2.5. Costes totales de los cursos</a></li>
<li><a href="#orgc88ccef">2.6. Insertar un ID automático en un estudiante</a></li>
<li><a href="#org21f7528">2.7. Actualizar campos de auditoría</a></li>
</ul>
</li>
<li><a href="#org3741f62">3. Sueldos y masa salarial (desnormalización)</a>
<ul>
<li><a href="#orgb4152bc">3.1. Tablas de masa salarial</a></li>
<li><a href="#orgc3731c9">3.2. Limitar los sueldos por arriba y por abajo</a></li>
<li><a href="#org656e0be">3.3. Inicializar la masa salarial</a></li>
<li><a href="#orga1f2850">3.4. Actualizar al borrar</a></li>
<li><a href="#org5c19257">3.5. Actualizar al modificar o insertar</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orga9805cc" class="outline-2">
<h2 id="orga9805cc"><span class="section-number-2">1</span> Programación</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org7637491" class="outline-3">
<h3 id="org7637491"><span class="section-number-3">1.1</span> Tabla de multiplicar Del 7</h3>
</div>
<div id="outline-container-org8cfe6bd" class="outline-3">
<h3 id="org8cfe6bd"><span class="section-number-3">1.2</span> Tablas de multiplicar del 1 al 9</h3>
</div>
<div id="outline-container-org0212e3c" class="outline-3">
<h3 id="org0212e3c"><span class="section-number-3">1.3</span> Tablas de multiplicar bien alineadas</h3>
</div>
<div id="outline-container-org4e46892" class="outline-3">
<h3 id="org4e46892"><span class="section-number-3">1.4</span> Pasar de decimal a binario</h3>
</div>
<div id="outline-container-orgb0a015d" class="outline-3">
<h3 id="orgb0a015d"><span class="section-number-3">1.5</span> Pasar de decimal a una base entre 2 y 16</h3>
</div>
<div id="outline-container-org5fe4821" class="outline-3">
<h3 id="org5fe4821"><span class="section-number-3">1.6</span> Pasar de una base de 2 a 16 a decimal</h3>
</div>
<div id="outline-container-org40402ac" class="outline-3">
<h3 id="org40402ac"><span class="section-number-3">1.7</span> Números primos menores de 1000</h3>
</div>
<div id="outline-container-org6b52540" class="outline-3">
<h3 id="org6b52540"><span class="section-number-3">1.8</span> Decidir si un número es capicúa</h3>
</div>
<div id="outline-container-org514ff0a" class="outline-3">
<h3 id="org514ff0a"><span class="section-number-3">1.9</span> Números primos capicúas menores de 100000</h3>
</div>

<div id="outline-container-org1c67092" class="outline-3">
<h3 id="org1c67092"><span class="section-number-3">1.10</span> Decidir si 1000003 es primo</h3>
<div class="outline-text-3" id="text-1-10">
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #b9ca4a;">declare</span>
  posibleprimo <span style="color: #7aa6da;">numeric</span>(10,0) := 1000003;
  limitededivisores <span style="color: #7aa6da;">numeric</span>(10,0);
  esprimo <span style="color: #7aa6da;">boolean</span> := <span style="color: #b9ca4a;">true</span>;
<span style="color: #b9ca4a;">begin</span>
  limitededivisores := sqrt(posibleprimo)+1;
  <span style="color: #b9ca4a;">for</span> posibledivisor <span style="color: #b9ca4a;">in</span> 2..limitededivisores loop
     esprimo := <span style="color: #c397d8;">mod</span>(posibleprimo,posibledivisor) &lt;&gt; 0;
     exit <span style="color: #b9ca4a;">when</span> <span style="color: #b9ca4a;">not</span> esprimo;

  <span style="color: #b9ca4a;">end</span> loop;
  if( esprimo ) <span style="color: #b9ca4a;">then</span>
    dbms_output.put_line( posibleprimo || <span style="color: #70c0b1;">' es primo'</span>  );
  <span style="color: #b9ca4a;">else</span>
    dbms_output.put_line( posibleprimo || <span style="color: #70c0b1;">' NO es primo'</span>  );
  <span style="color: #b9ca4a;">end</span> if;
<span style="color: #b9ca4a;">end</span>;
/
</pre>
</div>
</div>
</div>


<div id="outline-container-org087bea4" class="outline-3">
<h3 id="org087bea4"><span class="section-number-3">1.11</span> Convertir boolean a char</h3>
<div class="outline-text-3" id="text-1-11">
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #b9ca4a;">create</span> <span style="color: #b9ca4a;">or</span> replace <span style="color: #b9ca4a;">function</span> <span style="color: #e78c45;">bool2char</span>(b <span style="color: #b9ca4a;">in</span> <span style="color: #7aa6da;">boolean</span>) <span style="color: #b9ca4a;">return</span> <span style="color: #7aa6da;">varchar</span> 
<span style="color: #b9ca4a;">is</span>
<span style="color: #b9ca4a;">begin</span>
  <span style="color: #b9ca4a;">return</span> (<span style="color: #b9ca4a;">case</span> b <span style="color: #b9ca4a;">when</span> <span style="color: #b9ca4a;">true</span> <span style="color: #b9ca4a;">then</span> <span style="color: #70c0b1;">'si'</span> <span style="color: #b9ca4a;">else</span> <span style="color: #70c0b1;">'no'</span> <span style="color: #b9ca4a;">end</span> );

<span style="color: #b9ca4a;">end</span>;
/
</pre>
</div>
</div>
</div>


<div id="outline-container-org2b00117" class="outline-3">
<h3 id="org2b00117"><span class="section-number-3">1.12</span> Primos</h3>
<div class="outline-text-3" id="text-1-12">
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #b9ca4a;">create</span> <span style="color: #b9ca4a;">or</span> replace <span style="color: #b9ca4a;">function</span> <span style="color: #e78c45;">es_primo</span>(posibleprimo <span style="color: #b9ca4a;">IN</span> <span style="color: #b9ca4a;">number</span>) <span style="color: #b9ca4a;">return</span> <span style="color: #7aa6da;">char</span>
<span style="color: #b9ca4a;">is</span>
  esprimo <span style="color: #7aa6da;">boolean</span> := <span style="color: #b9ca4a;">true</span>;
<span style="color: #b9ca4a;">begin</span>
  <span style="color: #b9ca4a;">for</span> posibledivisor <span style="color: #b9ca4a;">in</span> 2..(sqrt(posibleprimo)) loop
     esprimo := <span style="color: #c397d8;">mod</span>(posibleprimo,posibledivisor) &lt;&gt; 0;
     exit <span style="color: #b9ca4a;">when</span> <span style="color: #b9ca4a;">not</span> esprimo;
  <span style="color: #b9ca4a;">end</span> loop;
  <span style="color: #b9ca4a;">return</span> <span style="color: #b9ca4a;">case</span> esprimo
    <span style="color: #b9ca4a;">when</span> <span style="color: #b9ca4a;">true</span> <span style="color: #b9ca4a;">then</span> <span style="color: #70c0b1;">'s'</span>
    <span style="color: #b9ca4a;">else</span> <span style="color: #70c0b1;">'n'</span> 
  <span style="color: #b9ca4a;">end</span>;  
<span style="color: #b9ca4a;">end</span>;
/
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sql"><span style="color: #b9ca4a;">begin</span>
  <span style="color: #b9ca4a;">for</span> i <span style="color: #b9ca4a;">in</span> 2 .. 1000 loop
    if( es_primo(i) = <span style="color: #70c0b1;">'s'</span> ) <span style="color: #b9ca4a;">then</span>
      dbms_output.put_line( <span style="color: #70c0b1;">'Es primo:'</span> || i );
    <span style="color: #b9ca4a;">end</span> if;
  <span style="color: #b9ca4a;">end</span> loop;
<span style="color: #b9ca4a;">end</span>;
/
</pre>
</div>
</div>
</div>


<div id="outline-container-orgc8423a5" class="outline-3">
<h3 id="orgc8423a5"><span class="section-number-3">1.13</span> Paso por valor</h3>
<div class="outline-text-3" id="text-1-13">
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #b9ca4a;">create</span> <span style="color: #b9ca4a;">or</span> replace <span style="color: #b9ca4a;">procedure</span> <span style="color: #e78c45;">sumaUno</span>(n <span style="color: #b9ca4a;">in</span> <span style="color: #b9ca4a;">out</span> <span style="color: #7aa6da;">numeric</span>)
<span style="color: #b9ca4a;">is</span>
<span style="color: #b9ca4a;">begin</span>
  n := n +1;
<span style="color: #b9ca4a;">end</span>;
/

<span style="color: #b9ca4a;">declare</span>
  numero <span style="color: #7aa6da;">numeric</span>(10,0);
<span style="color: #b9ca4a;">begin</span>
  numero := 3;
  sumauno(3);
  dbms_output.put_line(numero);
<span style="color: #b9ca4a;">end</span>;
/

</pre>
</div>
</div>
</div>
</div>






<div id="outline-container-org28a1595" class="outline-2">
<h2 id="org28a1595"><span class="section-number-2">2</span> Estudiantes</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org910731b" class="outline-3">
<h3 id="org910731b"><span class="section-number-3">2.1</span> Estadística por nombre</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #b9ca4a;">create</span> <span style="color: #b9ca4a;">or</span> replace <span style="color: #b9ca4a;">function</span> <span style="color: #e78c45;">cuantos_se_llaman</span>(nombre_o_apellidos <span style="color: #b9ca4a;">in</span> <span style="color: #7aa6da;">varchar</span>) <span style="color: #b9ca4a;">return</span> <span style="color: #7aa6da;">numeric</span>
<span style="color: #b9ca4a;">as</span>
  cuantosnombres <span style="color: #7aa6da;">numeric</span>;
  cuantosapellidos <span style="color: #7aa6da;">numeric</span>;

<span style="color: #b9ca4a;">begin</span>
  <span style="color: #b9ca4a;">select</span> <span style="color: #c397d8;">count</span>(*) 
     <span style="color: #b9ca4a;">into</span> cuantosnombres 
     <span style="color: #b9ca4a;">from</span> student 
     <span style="color: #b9ca4a;">where</span> first_name = nombre_o_apellidos;

  <span style="color: #b9ca4a;">select</span> <span style="color: #c397d8;">count</span>(*) 
     <span style="color: #b9ca4a;">into</span> cuantosapellidos 
     <span style="color: #b9ca4a;">from</span> student 
     <span style="color: #b9ca4a;">where</span> last_name = nombre_o_apellidos;

  <span style="color: #b9ca4a;">return</span> cuantosnombres + cuantosapellidos;

<span style="color: #b9ca4a;">end</span>;
/

<span style="color: #b9ca4a;">begin</span>
  dbms_output.put_line( cuantos_se_llaman(<span style="color: #70c0b1;">'Gonz&#225;lez'</span>) );
<span style="color: #b9ca4a;">end</span>;
/
</pre>
</div>
</div>
</div>
