gestion-bd-asir1/apuntes/6/BD-6-Ejemplos-PLSQL.html


<div id="outline-container-org30ebee3" class="outline-3">
<h3 id="org30ebee3"><span class="section-number-3">2.2</span> Matricular un hermano</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Un hermano comparte todos los datos, excepto el nombre y el tratamiento
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #b9ca4a;">create</span> <span style="color: #b9ca4a;">or</span> replace 
<span style="color: #b9ca4a;">PROCEDURE</span> MATRICULAR_HERMANO(student_id_existente <span style="color: #b9ca4a;">number</span>, saludo_hermano <span style="color: #7aa6da;">varchar</span>, nombre_hermano <span style="color: #7aa6da;">varchar</span>) <span style="color: #b9ca4a;">AS</span> 
  alumno_existente student%ROWTYPE;
<span style="color: #b9ca4a;">BEGIN</span>
  <span style="color: #b9ca4a;">select</span> * <span style="color: #b9ca4a;">into</span> alumno_existente <span style="color: #b9ca4a;">from</span> student <span style="color: #b9ca4a;">where</span> student_id = student_id_existente;

  <span style="color: #b9ca4a;">select</span> <span style="color: #c397d8;">max</span>(student_id)+1 <span style="color: #b9ca4a;">into</span> alumno_existente.student_id <span style="color: #b9ca4a;">from</span> student;

  alumno_existente.salutation := saludo_hermano;  
  alumno_existente.first_name := nombre_hermano;

  <span style="color: #b9ca4a;">insert</span> <span style="color: #b9ca4a;">into</span> student <span style="color: #b9ca4a;">values</span> alumno_existente;

<span style="color: #b9ca4a;">END</span> MATRICULAR_HERMANO;
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb256afb" class="outline-3">
<h3 id="orgb256afb"><span class="section-number-3">2.3</span> Calcular nota máxima y mínima</h3>
<div class="outline-text-3" id="text-2-3">
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #b9ca4a;">create</span> <span style="color: #b9ca4a;">or</span> replace <span style="color: #b9ca4a;">function</span> <span style="color: #e78c45;">maxima_minima_nota</span>(
  maximo <span style="color: #b9ca4a;">out</span> <span style="color: #7aa6da;">numeric</span>,
  minimo <span style="color: #b9ca4a;">out</span> <span style="color: #7aa6da;">numeric</span>
)
<span style="color: #b9ca4a;">return</span> <span style="color: #7aa6da;">varchar</span>
<span style="color: #b9ca4a;">as</span>
  retorno <span style="color: #7aa6da;">varchar</span>(15) := <span style="color: #70c0b1;">'sin datos'</span>;
<span style="color: #b9ca4a;">begin</span>
  maximo := -1000;
  minimo := 1000;
  <span style="color: #b9ca4a;">for</span> g <span style="color: #b9ca4a;">in</span> (<span style="color: #b9ca4a;">select</span> * <span style="color: #b9ca4a;">from</span> grade) loop
    retorno := <span style="color: #70c0b1;">'ok'</span>;
    maximo := greatest(maximo,g.numeric_grade);
    minimo := least(minimo,g.numeric_grade);
  <span style="color: #b9ca4a;">end</span> loop;
  <span style="color: #b9ca4a;">return</span> retorno;
<span style="color: #b9ca4a;">end</span>;
/
</pre>
</div>
</div>
</div>

<div id="outline-container-orgcd3e5f3" class="outline-3">
<h3 id="orgcd3e5f3"><span class="section-number-3">2.4</span> Calcular la media de notas por encima de cierto valor</h3>
<div class="outline-text-3" id="text-2-4">
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #b9ca4a;">create</span> <span style="color: #b9ca4a;">or</span> replace 
<span style="color: #b9ca4a;">FUNCTION</span> MEDIA_DE_GRADES(minimo <span style="color: #b9ca4a;">number</span>) <span style="color: #b9ca4a;">RETURN</span> <span style="color: #b9ca4a;">number</span> <span style="color: #b9ca4a;">AS</span> 
  total <span style="color: #b9ca4a;">number</span>;
  numero <span style="color: #b9ca4a;">number</span>;
<span style="color: #b9ca4a;">BEGIN</span>
  total := 0;
  numero := 0;
  <span style="color: #b9ca4a;">for</span> g <span style="color: #b9ca4a;">in</span> (<span style="color: #b9ca4a;">select</span> numeric_grade <span style="color: #b9ca4a;">from</span> grade) 
  loop
    if g.numeric_grade &gt; minimo <span style="color: #b9ca4a;">then</span>
      total := total + g.numeric_grade;
      numero := numero + 1;
    <span style="color: #b9ca4a;">end</span> if;
  <span style="color: #b9ca4a;">end</span> loop;

  <span style="color: #b9ca4a;">return</span> total/numero;

<span style="color: #b9ca4a;">END</span> MEDIA_DE_GRADES;
</pre>
</div>
</div>
</div>

<div id="outline-container-org6fed05d" class="outline-3">
<h3 id="org6fed05d"><span class="section-number-3">2.5</span> Costes totales de los cursos</h3>
<div class="outline-text-3" id="text-2-5">
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #b9ca4a;">create</span> <span style="color: #b9ca4a;">or</span> replace 
<span style="color: #b9ca4a;">FUNCTION</span> SUMACOSTES <span style="color: #b9ca4a;">RETURN</span> <span style="color: #b9ca4a;">NUMBER</span> <span style="color: #b9ca4a;">AS</span> 
  <span style="color: #b9ca4a;">CURSOR</span> c_courses <span style="color: #b9ca4a;">is</span> <span style="color: #b9ca4a;">select</span> cost, course_no <span style="color: #b9ca4a;">from</span> course;
  resultado <span style="color: #b9ca4a;">number</span>;
  coste <span style="color: #b9ca4a;">number</span>;
  numerocurso <span style="color: #b9ca4a;">number</span>;
<span style="color: #b9ca4a;">BEGIN</span>
  resultado := 0;
  <span style="color: #b9ca4a;">open</span> c_courses;

  <span style="color: #b9ca4a;">fetch</span> c_courses <span style="color: #b9ca4a;">into</span> coste, numerocurso;
  while <span style="color: #b9ca4a;">not</span> c_courses%NOTFOUND LOOP
    if coste <span style="color: #b9ca4a;">is</span> <span style="color: #b9ca4a;">not</span> <span style="color: #b9ca4a;">null</span> <span style="color: #b9ca4a;">then</span>
      resultado := resultado + coste;
    <span style="color: #b9ca4a;">else</span>
      SYS.dbms_output.put_line( <span style="color: #70c0b1;">'Es null:'</span> || numerocurso );
    <span style="color: #b9ca4a;">end</span> if;
    <span style="color: #b9ca4a;">fetch</span> c_courses <span style="color: #b9ca4a;">into</span> coste, numerocurso;
  <span style="color: #b9ca4a;">end</span> loop;

  <span style="color: #b9ca4a;">close</span> c_courses;
  <span style="color: #b9ca4a;">return</span> resultado;
<span style="color: #b9ca4a;">END</span>;
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc88ccef" class="outline-3">
<h3 id="orgc88ccef"><span class="section-number-3">2.6</span> Insertar un ID automático en un estudiante</h3>
<div class="outline-text-3" id="text-2-6">
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #b9ca4a;">CREATE</span> <span style="color: #b9ca4a;">OR</span> REPLACE <span style="color: #b9ca4a;">TRIGGER</span> "ALUMNO"."PONER_ID_A_STUDENT" 
   <span style="color: #b9ca4a;">before</span> <span style="color: #b9ca4a;">insert</span> <span style="color: #b9ca4a;">on</span> "ALUMNO"."STUDENT" 
   <span style="color: #b9ca4a;">for</span> <span style="color: #b9ca4a;">each</span> <span style="color: #7aa6da;">row</span> 
<span style="color: #b9ca4a;">begin</span>  
   if inserting <span style="color: #b9ca4a;">then</span> 
      if :<span style="color: #b9ca4a;">NEW</span>."STUDENT_ID" <span style="color: #b9ca4a;">is</span> <span style="color: #b9ca4a;">null</span> <span style="color: #b9ca4a;">then</span> 
         <span style="color: #b9ca4a;">select</span> STUDENT_ID_SEQ.nextval <span style="color: #b9ca4a;">into</span> :<span style="color: #b9ca4a;">NEW</span>."STUDENT_ID" <span style="color: #b9ca4a;">from</span> dual; 
      <span style="color: #b9ca4a;">end</span> if; 
   <span style="color: #b9ca4a;">end</span> if; 
<span style="color: #b9ca4a;">end</span>;
<span style="color: #b9ca4a;">ALTER</span> <span style="color: #b9ca4a;">TRIGGER</span> "ALUMNO"."PONER_ID_A_STUDENT" ENABLE;
</pre>
</div>
</div>
</div>

<div id="outline-container-org21f7528" class="outline-3">
<h3 id="org21f7528"><span class="section-number-3">2.7</span> Actualizar campos de auditoría</h3>
<div class="outline-text-3" id="text-2-7">
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #b9ca4a;">create</span> <span style="color: #b9ca4a;">or</span> replace <span style="color: #b9ca4a;">trigger</span> <span style="color: #e78c45;">actualiza_lo_de_modificado</span>
<span style="color: #b9ca4a;">before</span> <span style="color: #b9ca4a;">update</span>
<span style="color: #b9ca4a;">on</span> student
<span style="color: #b9ca4a;">for</span> <span style="color: #b9ca4a;">each</span> <span style="color: #7aa6da;">row</span>
<span style="color: #b9ca4a;">begin</span>
  :<span style="color: #b9ca4a;">new</span>.modified_by := <span style="color: #c397d8;">user</span>;
  :<span style="color: #b9ca4a;">new</span>.modified_date := sysdate;
<span style="color: #b9ca4a;">end</span>;
/
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org3741f62" class="outline-2">
<h2 id="org3741f62"><span class="section-number-2">3</span> Sueldos y masa salarial (desnormalización)</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgb4152bc" class="outline-3">
<h3 id="orgb4152bc"><span class="section-number-3">3.1</span> Tablas de masa salarial</h3>
<div class="outline-text-3" id="text-3-1">
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #b9ca4a;">create</span> <span style="color: #b9ca4a;">table</span> <span style="color: #e78c45;">sueldos</span>( sueldo <span style="color: #7aa6da;">numeric</span>)
<span style="color: #b9ca4a;">create</span> <span style="color: #b9ca4a;">table</span> <span style="color: #e78c45;">masasalarialtotal</span>(id <span style="color: #7aa6da;">integer</span>, total <span style="color: #7aa6da;">numeric</span>);
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc3731c9" class="outline-3">
<h3 id="orgc3731c9"><span class="section-number-3">3.2</span> Limitar los sueldos por arriba y por abajo</h3>
<div class="outline-text-3" id="text-3-2">
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #b9ca4a;">CREATE</span> <span style="color: #b9ca4a;">TRIGGER</span> <span style="color: #e78c45;">COMPROBAR_SUELDO</span>
<span style="color: #b9ca4a;">BEFORE</span>
<span style="color: #b9ca4a;">INSERT</span> <span style="color: #b9ca4a;">OR</span> <span style="color: #b9ca4a;">UPDATE</span> <span style="color: #b9ca4a;">OF</span> SALARIO, PUESTO <span style="color: #b9ca4a;">ON</span> EMPLEADOS
<span style="color: #b9ca4a;">FOR</span> <span style="color: #b9ca4a;">EACH</span> <span style="color: #7aa6da;">ROW</span>
<span style="color: #b9ca4a;">WHEN</span> (<span style="color: #b9ca4a;">NEW</span>.PUESTO &lt;&gt; <span style="color: #70c0b1;">'PRESIDENTE'</span>)
<span style="color: #b9ca4a;">DECLARE</span>
SUELDO_FUERA_RANGO <span style="color: #b9ca4a;">EXCEPTION</span>;
<span style="color: #b9ca4a;">BEGIN</span>
IF (:<span style="color: #b9ca4a;">NEW</span>.SALARIO &lt; 100000 <span style="color: #b9ca4a;">OR</span>
:<span style="color: #b9ca4a;">NEW</span>.SALARIO &gt; 1000000) <span style="color: #b9ca4a;">THEN</span>
RAISE SUELDO_FUERA_RANGO;
<span style="color: #b9ca4a;">END</span> IF;
<span style="color: #b9ca4a;">END</span>;
</pre>
</div>
</div>
</div>
