gestion-bd-asir1/apuntes/6/BD-6-Ejemplos-PLSQL.org
** Inicializar la masa salarial
#+begin_src sql
CREATE OR REPLACE PROCEDURE INICIALIZA_MASA_SALARIAL_TOTAL AS 
  t number;
BEGIN
  select sum(sueldo) into t from sueldos;
  if t is null then
    t := 0;
  end if;
  update masasalarialtotal set total = t;
END INICIALIZA_MASA_SALARIAL_TOTAL;
#+end_src


** Actualizar al borrar
#+begin_src sql
CREATE OR REPLACE TRIGGER MASA_SALARIAL_BORRANDO 
BEFORE DELETE ON SUELDOS 
FOR EACH ROW 
BEGIN
  UPDATE masasalarialtotal set total = total - :old.sueldo;
END; 
#+end_src



** Actualizar al modificar o insertar
#+begin_src sql
CREATE OR REPLACE TRIGGER MENOR_DE_UN_MILLON 
BEFORE INSERT or update ON SUELDOS
for each row
declare
  masasalarial number;
  sueldo_fuera_de_rango exception;
BEGIN

  if inserting then
    masasalarial := masasalarial + :new.sueldo;
  end if;
  
  if updating then
    select total into masasalarial from masasalarialtotal where id=1;
    masasalarial := masasalarial - :old.sueldo + :new.sueldo;
  end if;
  
  if  masasalarial > 1000000  then
    raise  sueldo_fuera_de_rango;
  end if;
  
  update masasalarialtotal set total = masasalarial;
END;
#+end_src

