gestion-bd-asir1/apuntes/6/BD-6-Ejemplos-PLSQL.html


<div id="outline-container-org656e0be" class="outline-3">
<h3 id="org656e0be"><span class="section-number-3">3.3</span> Inicializar la masa salarial</h3>
<div class="outline-text-3" id="text-3-3">
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #b9ca4a;">CREATE</span> <span style="color: #b9ca4a;">OR</span> REPLACE <span style="color: #b9ca4a;">PROCEDURE</span> <span style="color: #e78c45;">INICIALIZA_MASA_SALARIAL_TOTAL</span> <span style="color: #b9ca4a;">AS</span> 
  t <span style="color: #b9ca4a;">number</span>;
<span style="color: #b9ca4a;">BEGIN</span>
  <span style="color: #b9ca4a;">select</span> <span style="color: #c397d8;">sum</span>(sueldo) <span style="color: #b9ca4a;">into</span> t <span style="color: #b9ca4a;">from</span> sueldos;
  if t <span style="color: #b9ca4a;">is</span> <span style="color: #b9ca4a;">null</span> <span style="color: #b9ca4a;">then</span>
    t := 0;
  <span style="color: #b9ca4a;">end</span> if;
  <span style="color: #b9ca4a;">update</span> masasalarialtotal <span style="color: #b9ca4a;">set</span> total = t;
<span style="color: #b9ca4a;">END</span> INICIALIZA_MASA_SALARIAL_TOTAL;
</pre>
</div>
</div>
</div>


<div id="outline-container-orga1f2850" class="outline-3">
<h3 id="orga1f2850"><span class="section-number-3">3.4</span> Actualizar al borrar</h3>
<div class="outline-text-3" id="text-3-4">
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #b9ca4a;">CREATE</span> <span style="color: #b9ca4a;">OR</span> REPLACE <span style="color: #b9ca4a;">TRIGGER</span> <span style="color: #e78c45;">MASA_SALARIAL_BORRANDO</span> 
<span style="color: #b9ca4a;">BEFORE</span> <span style="color: #b9ca4a;">DELETE</span> <span style="color: #b9ca4a;">ON</span> SUELDOS 
<span style="color: #b9ca4a;">FOR</span> <span style="color: #b9ca4a;">EACH</span> <span style="color: #7aa6da;">ROW</span> 
<span style="color: #b9ca4a;">BEGIN</span>
  <span style="color: #b9ca4a;">UPDATE</span> masasalarialtotal <span style="color: #b9ca4a;">set</span> total = total - :<span style="color: #b9ca4a;">old</span>.sueldo;
<span style="color: #b9ca4a;">END</span>; 
</pre>
</div>
</div>
</div>



<div id="outline-container-org5c19257" class="outline-3">
<h3 id="org5c19257"><span class="section-number-3">3.5</span> Actualizar al modificar o insertar</h3>
<div class="outline-text-3" id="text-3-5">
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #b9ca4a;">CREATE</span> <span style="color: #b9ca4a;">OR</span> REPLACE <span style="color: #b9ca4a;">TRIGGER</span> <span style="color: #e78c45;">MENOR_DE_UN_MILLON</span> 
<span style="color: #b9ca4a;">BEFORE</span> <span style="color: #b9ca4a;">INSERT</span> <span style="color: #b9ca4a;">or</span> <span style="color: #b9ca4a;">update</span> <span style="color: #b9ca4a;">ON</span> SUELDOS
<span style="color: #b9ca4a;">for</span> <span style="color: #b9ca4a;">each</span> <span style="color: #7aa6da;">row</span>
<span style="color: #b9ca4a;">declare</span>
  masasalarial <span style="color: #b9ca4a;">number</span>;
  sueldo_fuera_de_rango <span style="color: #b9ca4a;">exception</span>;
<span style="color: #b9ca4a;">BEGIN</span>

  if inserting <span style="color: #b9ca4a;">then</span>
    masasalarial := masasalarial + :<span style="color: #b9ca4a;">new</span>.sueldo;
  <span style="color: #b9ca4a;">end</span> if;

  if updating <span style="color: #b9ca4a;">then</span>
    <span style="color: #b9ca4a;">select</span> total <span style="color: #b9ca4a;">into</span> masasalarial <span style="color: #b9ca4a;">from</span> masasalarialtotal <span style="color: #b9ca4a;">where</span> id=1;
    masasalarial := masasalarial - :<span style="color: #b9ca4a;">old</span>.sueldo + :<span style="color: #b9ca4a;">new</span>.sueldo;
  <span style="color: #b9ca4a;">end</span> if;

  if  masasalarial &gt; 1000000  <span style="color: #b9ca4a;">then</span>
    raise  sueldo_fuera_de_rango;
  <span style="color: #b9ca4a;">end</span> if;

  <span style="color: #b9ca4a;">update</span> masasalarialtotal <span style="color: #b9ca4a;">set</span> total = masasalarial;
<span style="color: #b9ca4a;">END</span>;
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: alvaro</p>
<p class="date">Created: 2018-04-03 mar 17:50</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
